public/programming/gists/c/utils.h.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org9147128" class="outline-2">
<h2 id="org9147128">C / utils.h</h2>
<div class="outline-text-2" id="text-org9147128">
<p>
Utility macros for C projects.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #989898;">// </span><span style="color: #989898;">SPDX-License-Identifier: MIT
</span><span style="color: #989898;">// </span><span style="color: #989898;">Author:  Giovanni Santini
</span><span style="color: #989898;">// </span><span style="color: #989898;">Mail:    giovanni.santini@proton.me
</span><span style="color: #989898;">// </span><span style="color: #989898;">Github:  @San7o
</span>
<span style="color: #ff7f9f;">#if</span><span style="color: #ff7f9f; font-weight: bold;">n</span><span style="color: #ff7f9f;">def</span> UTILS_H
<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">UTILS_H</span>

<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;stdio.h&gt;</span>
<span style="color: #ff7f9f;">#include</span> <span style="color: #79a8ff;">&lt;stdlib.h&gt;</span>

<span style="color: #989898;">//</span><span style="color: #989898;">
</span><span style="color: #989898;">// </span><span style="color: #989898;">Macros
</span><span style="color: #989898;">//</span><span style="color: #989898;">
</span>
<span style="color: #ff7f9f;">#define</span> <span style="color: #feacd0;">UNUSED</span>(<span style="color: #00d3d0;">value</span>) (<span style="color: #6ae4b9;">void</span>)(value)
<span style="color: #ff7f9f;">#define</span> <span style="color: #feacd0;">TODO</span>(<span style="color: #00d3d0;">message</span>) <span style="color: #b6a0ff;">do</span> { fprintf(stderr, <span style="color: #79a8ff;">"%s:%d: TODO: %s\n"</span>, __FILE__, __LINE__, message); abort(); } <span style="color: #b6a0ff;">while</span>(0)
<span style="color: #ff7f9f;">#define</span> <span style="color: #feacd0;">UNREACHABLE</span>(<span style="color: #00d3d0;">message</span>) <span style="color: #b6a0ff;">do</span> { fprintf(stderr, <span style="color: #79a8ff;">"%s:%d: UNREACHABLE: %s\n"</span>, __FILE__, __LINE__, message); abort(); } <span style="color: #b6a0ff;">while</span>(0)

<span style="color: #ff7f9f;">#define</span> <span style="color: #00d3d0;">cleanup_free</span> <span style="color: #b6a0ff;">__attribute__</span> ((cleanup (cleanup_freep)))

<span style="color: #ff7f9f;">#ifdef</span> __GNUC__
<span style="color: #ff7f9f;">  #define</span> <span style="color: #feacd0;">LIKELY</span>(<span style="color: #00d3d0;">x</span>)     __builtin_expect(<span style="color: #ff5f59; font-weight: bold;">!</span>!(x), 1)
<span style="color: #ff7f9f;">  #define</span> <span style="color: #feacd0;">UNLIKELY</span>(<span style="color: #00d3d0;">x</span>)   __builtin_expect(<span style="color: #ff5f59; font-weight: bold;">!</span>!(x), 0)
<span style="color: #ff7f9f;">#else</span>
<span style="color: #ff7f9f;"> #define</span> <span style="color: #feacd0;">LIKELY</span>(<span style="color: #00d3d0;">x</span>)     (x)
<span style="color: #ff7f9f;"> #define</span> <span style="color: #feacd0;">UNLIKELY</span>(<span style="color: #00d3d0;">x</span>)   (x)
<span style="color: #ff7f9f;">#endif</span>

<span style="color: #989898;">//</span><span style="color: #989898;">
</span><span style="color: #989898;">// </span><span style="color: #989898;">Functions
</span><span style="color: #989898;">//</span><span style="color: #989898;">
</span>
<span style="color: #b6a0ff;">static</span> <span style="color: #b6a0ff;">inline</span> <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">cleanup_freep</span>(<span style="color: #6ae4b9;">void</span> *<span style="color: #00d3d0;">p</span>) {
    free(*(<span style="color: #6ae4b9;">void</span> **)p);
}

<span style="color: #ff7f9f;">#endif</span> <span style="color: #989898;">// </span><span style="color: #989898;">UTILS_H</span>
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
